Ameba-AIoT/ameba-arduino-d/Arduino_package/hardware/system/libameba/sdk/component/soc/realtek/amebad/wifi_fw/include/RTL8721D_autoconf.h
#ifndef _AUTOCONF_H_
#define _AUTOCONF_H_


/******************************************

        Chip Selection
        
// Field     RTLCHIP        CHIPCUT
// BITS  [15:4]       [3:0]


*******************************************/
//Warning: The line format can't be modified(from Chip Select to Special Configuration). 
//It is used for parsing.

#define AUTOBUILD_START_PREFIX 1

//2 Main Config
//3 1.) Chip Select
//#define CONFIG_CHIP_SEL RTL8721D_TEST_CHIP_S      //8721D has no testchip
#define CONFIG_CHIP_SEL RTL8721D_A_CUT_S
//#define CONFIG_CHIP_SEL RTL8721D_B_CUT_U




//3 2.) Category Select  [NIC/AP/General] [SDIO/USB/PCIE/General]
//Warning: The line format can't be modified. It is used for parsing.
//#define CONFIG_CATEGORY_SEL RTLCHIP_CATEGORY_NIC_GENERAL
//#define CONFIG_CATEGORY_SEL RTLCHIP_CATEGORY_AP_GENERAL
//#define CONFIG_CATEGORY_SEL RTLCHIP_CATEGORY_NIC_WOWLAN
#define CONFIG_CATEGORY_SEL RTLCHIP_CATEGORY_NIC_IoT

//3 3.) Special Configuration (This should be disable in ASIC!)
#define CONFIG_ICE_MODE                 0
#define CONFIG_VERA_ENV                 0
#define CONFIG_KEIL_C_SIMULATION        0
#define CONFIG_VERIFICATION_MODE        0
#define CONFIG_8051_INT_TESTING         0

#define AUTOBUILD_END_PREFIX 1
/******************************************

    System Configuration                                                

*******************************************/

//2 Memory Layout
// TODO: Check below setting
#define MINIMUM_STACK_SIZE          0x40
#define RAM_CODE_START_ADDRESS      0x8000
#define XDATA_START_ADDRESS         0x8000
#define TXBUFF_CODE_START_ADDRESS   0xE000
#define XDATA_LENGTH                0x3000  //12k bytes

#if IS_CUT_A(CONFIG_CHIP_SEL)
#define PDATA_START_ADDRESS         0x9000  //XDATA_START_ADDRESS
#define PDATA_LENGTH                0x100   // 256 bytes
#define PPAGE_NUM                   (PDATA_START_ADDRESS>>8)
#else
#define PDATA_START_ADDRESS         0
#define PDATA_LENGTH                0
#define PPAGE_NUM                   0
#endif      //#if IS_CUT_A(CONFIG_CHIP_SEL)

#define SFR_MPAGE                   0x92

//Stretch Memory Cycle
//#define CKCON_NORMAL                0x2       //Can't be modified. Bounding for ROM code
#define CKCON_NORMAL                0x1     //Can't be modified. Bounding for ROM code
#define CKCON_ICE_MODE              0x3     //Can't be modified. Bounding for ROM code

//Write PON Delay
#define WAIT_US_WRITE_POWERON_8723B   16      //Can't be modified. Bounding for ROM code

//TRX Packet Buffer Indirect Access Page Size
#define PAGE_SIZE_IA_TXPKTBUF       256
#define PAGE_SIZE_IA_RXPKTBUF       256

//Page Size
#define PAGESIZE_TX                 128
#define PAGESIZE_RX                 8

//TXPKTBUF page
//TXPKTBUF : 32K
#define TX_PAGE_NUM			256		


//TRX DESC Size
#define SIZE_RX_DESC_MAC            24
#define SIZE_TX_DESC_MAC            40

#define EFUSE_SIZE                  512
#define PKTBUF_DBG_DATASIZE         8

#define MACID_NUM                   16

// Para Alan
#define LENGTH_IEEE80211_HDR_3ADDR  24
#define FIX_IE_LENGTH               12

//security cam
#define SECCAM_ENTRY_NUM        32    
#define SECCAM_DIRECT_ENTRY_SIZE                  32
#define SECCAM_START_ADDR        0x1A00
/******************************************

    ROM Code Configuration                                              

*******************************************/
//1 ROM Version  
#if IS_CHIP_8721D(CONFIG_CHIP_SEL)
    #if IS_CUT_TEST(CONFIG_CHIP_SEL)
        #define ROM_VERSION   1
    #elif IS_CUT_A(CONFIG_CHIP_SEL)
        #define ROM_VERSION   2
    #elif IS_CUT_B(CONFIG_CHIP_SEL) 
        #define ROM_VERSION   3
    #else
        #error "Cut Error"
    #endif  //IS_CUT_TEST(CONFIG_CHIP_SEL)
#else
    #error  "Chip Error"
#endif
#define ROM_VERSION_VERA            0xFF



//1 Functionality

//2 Common - Immobilization 
//Can't be modified. Bounding for ROM code
#define CONFIG_INIT_OFFLOAD             0   
#define CONFIG_FWLB                     1   
#define CONFIG_WLAN_ENGINE_ROM          1   //Can't be modified. Bounding for ROM code    
#define CONFIG_ROMDLFW                  0   

#define CONFIG_RF_JAGUAR                0   //8723d no support new 3-wire

#define CONFIG_U3_INT                   0

#define CONFIG_ROM_PATCH                0
#define CONFIG_ROM_32K                  1




//2 Common 
#define CONFIG_TXBF                     0
#if CONFIG_TXBF
    #define CONFIG_FW_SND               0       //8723b not support TxBF
#else
    #define CONFIG_FW_SND               0
#endif
#define CONFIG_DRV_FW_CTRL              0
#define CONFIG_8BYTE_H2C                1
#define CONFIG_C2H_PKT                  1
#define CONFIG_C2H_REG                  0
#define CONFIG_PSD_OFFLOAD              0
#define CONFIG_RLPS                     0   // disable RLPS
#define CONFIG_RLPS_METHOD0             1
#define CONFIG_RLPS_METHOD1             0
#define CONFIG_BB_GAIN_RPT              0
#define CONFIG_BB_NHM                   0
#define CONFIG_Efuse_Hidden_Request     0
#define CONFIG_Defeature                0


//2 1.) CATEGORY : NIC
#if IS_CATEGORY_NIC(CONFIG_CATEGORY_SEL)
//3 General
#define CONFIG_DISCONNECT_DECISION      0
#define CONFIG_KEEP_ALIVE               0
#define CONFIG_FAST_CHANNEL_SWITCH      1
#if CONFIG_FAST_CHANNEL_SWITCH
#define CONFIG_FCS_LOGO                 1
#define CONFIG_MCC                      0
#define CONFIG_NOA_ISR                  0 //use NOA isr replace GTimer, no work 0717...
#define CONFIG_PS_TIMER                 0
#else
#define CONFIG_FCS_LOGO                 0
#define CONFIG_MCC                      0
#define CONFIG_NOA_ISR                  0
#define CONFIG_PS_TIMER                 0
#endif //#if CONFIG_FAST_CHANNEL_SWITCH

#define CONFIG_D0_SCAN_OFFLOAD          0
#define CONFIG_SWITCH_CAHNNEL_OFFLOAD   0
#define CONFIG_SINGLE_SWITCH_CHANNEL    1
#define CONFIG_ECSA                     0

#if (CONFIG_FAST_CHANNEL_SWITCH || CONFIG_D0_SCAN_OFFLOAD || CONFIG_SWITCH_CAHNNEL_OFFLOAD)
#define CONFIG_RF_SETTING               1
#else
#define CONFIG_RF_SETTING               0
#endif  //#if (CONFIG_FAST_CHANNEL_SWITCH || CONFIG_D0_SCAN_OFFLOAD || CONFIG_SWITCH_CAHNNEL_OFFLOAD)

