Ameba-AIoT/ameba-arduino-d/Arduino_package/hardware/system/libameba/sdk/component/soc/realtek/amebad/wifi_fw/include/RTL8721D_autoconf.h
#define CONFIG_IQK_OFFLOAD              0


//3 AP offload  //Alan
#define CONFIG_AP_OFFLOAD               1
#if CONFIG_AP_OFFLOAD
#define CONFIG_MIFI_PLATFORM        0
#else
#define CONFIG_MIFI_PLATFORM        0
#endif
#define CONFIG_AP_TXBCNERR_PATCH        0

#define CONFIG_AP_PS_OFFLOAD                    0
#define CONFIG_STA_AGING_FUNC                   0
#define CONFIG_HW_DETECT_PS_OFFLOAD             0

#endif  //#if IS_CATEGORY_AP(CONFIG_CATEGORY_SEL)


//2 3.) CATEGORY : WOWLAN

#if IS_CATEGORY_WOWLAN(CONFIG_CATEGORY_SEL)
//3 General
#define CONFIG_DISCONNECT_DECISION      1
#define CONFIG_KEEP_ALIVE               1
#define CONFIG_FAST_CHANNEL_SWITCH      0
#if CONFIG_FAST_CHANNEL_SWITCH
#define CONFIG_FCS_LOGO                 0
#define CONFIG_MCC                      0
#define CONFIG_NOA_ISR                  0 //use NOA isr replace GTimer, no work 0717...
#define CONFIG_PS_TIMER                 0
#else
#define CONFIG_FCS_LOGO                 0
#define CONFIG_MCC                      0
#define CONFIG_NOA_ISR                  0
#define CONFIG_PS_TIMER                 0
#endif //#if CONFIG_FAST_CHANNEL_SWITCH

#define CONFIG_D0_SCAN_OFFLOAD          1
#define CONFIG_SWITCH_CAHNNEL_OFFLOAD   0
#define CONFIG_SINGLE_SWITCH_CHANNEL    0
#define CONFIG_ECSA                     0

#if (CONFIG_FAST_CHANNEL_SWITCH || CONFIG_D0_SCAN_OFFLOAD || CONFIG_SWITCH_CAHNNEL_OFFLOAD)
#define CONFIG_RF_SETTING               1
#else
#define CONFIG_RF_SETTING               0
#endif  //#if (CONFIG_FAST_CHANNEL_SWITCH || CONFIG_D0_SCAN_OFFLOAD || CONFIG_SWITCH_CAHNNEL_OFFLOAD)

#define CONFIG_SW_TIMER                 1
#define CONFIG_EFUSE_PART_NUM           0  
#define CONFIG_TXBEACON_IGNORE_EDCCA	0
#define CONFIG_TX_PAUSE_DRV_INFO		1
#define CONFIG_MACID_PAUSE_DRV_INFO		0
#define CONFIG_TX_PAUSE_WO_MASK         0


//3 PS Related
#define CONFIG_SAPPS                    0
#define CONFIG_NOLINK_PS                0
#define CONFIG_INACTIVE_PS              1
#define CONFIG_POWERSAVING              1
#if CONFIG_POWERSAVING
    #define CONFIG_HW_PS_CTRL           1
    #define CONFIG_PS_SUPPORT_32K       1
    #define CONFIG_PARTIAL_OFF              1
    #define CONFIG_LOWPWR_RXMODE        0   //It is not supported by 88E
    #define CONFIG_WMMPS                0
    #define CONFIG_P2P_PS               0
    #define CONFIG_FAST_CPWM            1
    #define CONFIG_TASK_IDLE_CHK        1
    #define CONFIG_BCNEARLY_ADJUST      1       //must not both enable!!ben, 170206
    #define CONFIG_BCNEARLY_ADJUST_V1       0	//must disable while CONFIG_NAN enable!!ben, 170206
    #define CONFIG_BCNEARLY_ADJUST_V2       0   //david_liu,181016
    #define CONFIG_LOWPWR_BEACON_MODE   0
    #define CONFIG_S1_NULL1_IVL_PATCH      0
#else
    #define CONFIG_HW_PS_CTRL           0
    #define CONFIG_PS_SUPPORT_32K       0
    #define CONFIG_PARTIAL_OFF              0
    #define CONFIG_LOWPWR_RXMODE        0   //It is not supported by 88E
    #define CONFIG_WMMPS                0
    #define CONFIG_P2P_PS               0
    #define CONFIG_FAST_CPWM            0
    #define CONFIG_TASK_IDLE_CHK        0
    #define CONFIG_BCNEARLY_ADJUST      0       //must not both enable!!ben, 170206
    #define CONFIG_BCNEARLY_ADJUST_V1       0	//must disable while CONFIG_NAN enable!!ben, 170206
    #define CONFIG_BCNEARLY_ADJUST_V2       0   //david_liu,181016
    #define CONFIG_LOWPWR_BEACON_MODE   0
    #define CONFIG_S1_NULL1_IVL_PATCH      0
#endif

//3NAN Related
#define CONFIG_NAN                          0

//3  LTE Coex Related
#define CONFIG_LTECOEX                         0    //alan, 2014_0207

//3 BT Coex Related
#define CONFIG_BTCOEX_CTRL              0
#define CONFIG_BT_MAILBOX               1
#define CONFIG_SW_MAILBOX               0
#define CONFIG_BT_MP_Mode              0    // alan , 2013_11_27


//3 Remote WakeUp
#define CONFIG_REMOTE_WAKEUP            1
#if CONFIG_REMOTE_WAKEUP
    #define CONFIG_WoWLAN               1
    #define CONFIG_AES_GTK              1   
    #define CONFIG_ARP                  1   
    #define CONFIG_NDP                  1 
    #define CONFIG_TEREDO_REALWOWL      0
    #define CONFIG_REALWOW_V2           1
    #define CONFIG_RTD3_SCAN_OFFLOAD    1    
    #define CONFIG_NLO_COMPLEX_OFFLOAD  0    // For Windows driver version
    #define CONFIG_NLO_SIMPLE_OFFLOAD   0    // For Linux driver version
    #define CODE_REDUCE                 1
    #define CONFIG_WOWLAN_APL_QQ        1
    #define CONFIG_ANT_SWT              1	//antenna switch in wowlan mode
    #define CONFIG_CUSTOMIZATION_GPIO   0
    #define CONFIG_P2P_OFFLOAD	        0
    #define CONFIG_SIDEBAND_WoWLAN      0
    #define CONFIG_RUNTIME_PM_OFFLOAD   0
    #define CONFIG_MULTI_FUNCTION       0
    #define CONFIG_DELAY_WAKEUP       0
    #define CONFIG_WPA2_ENTERPRISE              0
    #define CONFIG_NEGATIVE_PATTERN     1
    #define CONFIG_ALL_DATA_WAKEUP      0
#else
    #define CONFIG_WoWLAN               0
    #define CONFIG_AES_GTK              0   
    #define CONFIG_ARP                  0   
    #define CONFIG_NDP                  0 
    #define CONFIG_TEREDO_REALWOWL      0
    #define CONFIG_REALWOW_V2           0
    #define CONFIG_RTD3_SCAN_OFFLOAD    0  
    #define CONFIG_NLO_COMPLEX_OFFLOAD  0        
    #define CONFIG_NLO_SIMPLE_OFFLOAD   0    
    #define CODE_REDUCE                 0
    #define CONFIG_WOWLAN_APL_QQ        0
    #define CONFIG_ANT_SWT              0	
    #define CONFIG_CUSTOMIZATION_GPIO   0
    #define CONFIG_P2P_OFFLOAD	        0	
    #define CONFIG_SIDEBAND_WoWLAN      0
    #define CONFIG_RUNTIME_PM_OFFLOAD   0
    #define CONFIG_MULTI_FUNCTION       0
    #define CONFIG_DELAY_WAKEUP       0
    #define CONFIG_WPA2_ENTERPRISE              0
    #define CONFIG_NEGATIVE_PATTERN     0
    #define CONFIG_ALL_DATA_WAKEUP      0
#endif


//3 Dynamic Mechanism Offload
#define CONFIG_RATE_ADAPTIVE            0
#if CONFIG_RATE_ADAPTIVE
    #define CONFIG_RA_PS_MODE           0
    #define CONFIG_CCX                  1
    #define CONFIG_POWER_TRAINING_WIL   1
    #define CONFIG_HALcom_RA            0
    #define CONFIG_HALcom_RA_2          0
    #define CONFIG_11AC_1SS             0
    #define CONFIG_11AC_2SS             0
    #define CONFIG_11N_1SS              1
    #define CONFIG_11N_2SS              0
    #define CONFIG_RA_MULTI_TRY         1
    #define CONFIG_RA_NSC_CALCULATE     1
    #define CONFIG_RA_SET_RAINFO        1 
    #define CONFIG_1SS_SL_GI_MULTI_TRY   1
#else
    #define CONFIG_RA_PS_MODE           0
    #define CONFIG_CCX                  0
    #define CONFIG_POWER_TRAINING_WIL   0
    #define CONFIG_HALcom_RA            0
    #define CONFIG_HALcom_RA_2          0
    #define CONFIG_11AC_1SS             0
    #define CONFIG_11AC_2SS             0
    #define CONFIG_11N_1SS              1
    #define CONFIG_11N_2SS              0
    #define CONFIG_RA_MULTI_TRY         0
    #define CONFIG_RA_NSC_CALCULATE     0
    #define CONFIG_RA_SET_RAINFO        0  
    #define CONFIG_1SS_SL_GI_MULTI_TRY   0
#endif  //#if CONFIG_RATE_ADAPTIVE

    #define CONFIG_11AC 			(CONFIG_11AC_1SS | CONFIG_11AC_2SS)
    #define CONFIG_11N 				(CONFIG_11N_1SS | CONFIG_11N_2SS)
    
    #define CONFIG_1SS 				(CONFIG_11N_1SS | CONFIG_11AC_1SS)
    #define CONFIG_2SS 				(CONFIG_11N_2SS | CONFIG_11AC_2SS)
    
