Ameba-AIoT/ameba-arduino-d/Arduino_package/hardware/system/libameba/sdk/component/soc/realtek/amebad/wifi_fw/include/RTL8721D_autoconf.h
//3 Dynamic Mechanism Offload
#define CONFIG_RATE_ADAPTIVE            1//must enable in formal FW
#if CONFIG_RATE_ADAPTIVE
    #define CONFIG_RA_PS_MODE           0
    #define CONFIG_CCX                  1
    #define CONFIG_POWER_TRAINING_WIL   1
    #define CONFIG_HALcom_RA            0
    #define CONFIG_HALcom_RA_2          0
    #define CONFIG_11AC_1SS             0
    #define CONFIG_11AC_2SS             0
    #define CONFIG_11N_1SS				1
    #define CONFIG_11N_2SS				0
    #define CONFIG_RA_MULTI_TRY         1
    #define CONFIG_RA_NSC_CALCULATE     1
    #define CONFIG_RA_SET_RAINFO        1  
    #define CONFIG_1SS_SL_GI_MULTI_TRY   1
#else
    #define CONFIG_RA_PS_MODE           0
    #define CONFIG_CCX                  0
    #define CONFIG_POWER_TRAINING_WIL   0
    #define CONFIG_HALcom_RA            0
    #define CONFIG_HALcom_RA_2          0
    #define CONFIG_11AC_1SS             0
    #define CONFIG_11AC_2SS             0
    #define CONFIG_11N_1SS				1
    #define CONFIG_11N_2SS				0
    #define CONFIG_RA_MULTI_TRY         0
    #define CONFIG_RA_NSC_CALCULATE     0
    #define CONFIG_RA_SET_RAINFO        0 
    #define CONFIG_1SS_SL_GI_MULTI_TRY   0
#endif  //#if CONFIG_RATE_ADAPTIVE

    #define CONFIG_11AC 			(CONFIG_11AC_1SS | CONFIG_11AC_2SS)
    #define CONFIG_11N 				(CONFIG_11N_1SS | CONFIG_11N_2SS)
    
    #define CONFIG_1SS 				(CONFIG_11N_1SS | CONFIG_11AC_1SS)
    #define CONFIG_2SS 				(CONFIG_11N_2SS | CONFIG_11AC_2SS)

#define CONFIG_IQK_OFFLOAD              0


//3 AP offload      //Alan
#define CONFIG_AP_OFFLOAD               0
#if CONFIG_AP_OFFLOAD
#define CONFIG_MIFI_PLATFORM        1
#else
#define CONFIG_MIFI_PLATFORM        0
#endif
#define CONFIG_AP_TXBCNERR_PATCH        0

#define CONFIG_AP_PS_OFFLOAD                    0
#define CONFIG_STA_AGING_FUNC                   0
#define CONFIG_HW_DETECT_PS_OFFLOAD             0

#endif  //#if IS_CATEGORY_NIC_IoT(CONFIG_CATEGORY_SEL)


//1  Patch Control
#define CONFIG_FWLBK_PATCH              0   //8188e fwlbk patch 
#define CONFIG_FWLBK_VHT_PATCH          0   //8812 testchip:patch for afelbk, this flag can't be enabled in normal release fw
#define CONFIG_TSF_RESET_PATCH          0
#define CONFIG_INITOFLD_PATCH_8812      0
#define CONFIG_IPSEC_ENGINE_RAM         0
#define CONFIG_H2CSWQUEUE               1
#define CONFIG_ADC_MASK_HANG_8812A      0

//1  Debug control
#define CONFIG_PC_DEBUG                 1
#define CONFIG_REG_DEBUG                1
#define CONFIG_PS_DEBUG                 1
#define CONFIG_WOW_DEBUG                0
#define CONFIG_RA_DEBUG                 0
#define CONFIG_RA_FPGA_DEBUG            0
#define CONFIG_DBGSTEP                  0   // 1
#define CONFIG_RA_TP_DEBUG              0   // 1   //verify with test program
#define CONFIG_MAILBOX_DEBUG            0
#define CONFIG_32K_DEBUG                1

/******************************************

    Debug Configuration                                              

*******************************************/

//3 Debug Mode Select: Below Flags must be clear to 0 before commit.
#define CONFIG_C2H_DEBUG                0
#define CONFIG_C2H_DEBUG_COMP           0
#define CONFIG_C2H_RA_DEBUG_CODE          1
#define CONFIG_UART_DEBUG               0
#if CONFIG_UART_DEBUG
#define CONFIG_UART_POLLING         1
#endif
#define CONFIG_SNIFFER_DEBUG            0

// RT_TRACE according to this compile flag, not yet add UART
#define CONFIG_DBGMODE                  ( (CONFIG_C2H_DEBUG&CONFIG_C2H_PKT) || CONFIG_SNIFFER_DEBUG || CONFIG_UART_DEBUG)

#if CONFIG_DBGMODE
#define CONFIG_C2HPRT_WOWLAN            0
#define CONFIG_C2HPRT_FCS               0
#define CONFIG_C2HPRT_POWERSAVEING      0

// ===> AP mode  debug­nª`·N!!! macid number = 16
#undef  MACID_NUM                   
#define MACID_NUM                       16

#else
#define CONFIG_C2HPRT_WOWLAN            0
#define CONFIG_C2HPRT_FCS               0
#define CONFIG_C2HPRT_POWERSAVEING      0

#endif  //#if CONFIG_DBGMODE



//3  DebugTool: Register Dump 


#define CONFIG_PRINT_DEBUG              1
#if CONFIG_PRINT_DEBUG
#define CONFIG_DEBUGPRT_COMMON          0
#define CONFIG_DEBUGPRT_RA              (CONFIG_PRINT_DEBUG & CONFIG_RATE_ADAPTIVE)
#define CONFIG_DEBUGPRT_CCX             0//(CONFIG_PRINT_DEBUG & CONFIG_CCX)    
#define CONFIG_DEBUGPRT_PS              0//(CONFIG_PRINT_DEBUG & CONFIG_POWERSAVING)
#define CONFIG_DEBUGPRT_BT              0//(CONFIG_PRINT_DEBUG & CONFIG_BT_MAILBOX)
#define CONFIG_DEBUGPRT_IQK             0//(CONFIG_PRINT_DEBUG & CONFIG_IQK_OFFLOAD)
#define CONFIG_DEBUGPRT_WOWLAN          0//(CONFIG_PRINT_DEBUG & CONFIG_REMOTE_WAKEUP)
#define CONFIG_DEBUGPRT_FCS             0//(CONFIG_PRINT_DEBUG & CONFIG_FAST_CHANNEL_SWITCH)
#else
#define CONFIG_DEBUGPRT_COMMON          0
#define CONFIG_DEBUGPRT_RA              0
#define CONFIG_DEBUGPRT_CCX             0
#define CONFIG_DEBUGPRT_PS              0
#define CONFIG_DEBUGPRT_BT              0
#define CONFIG_DEBUGPRT_IQK             0
#define CONFIG_DEBUGPRT_WOWLAN          0
#define CONFIG_DEBUGPRT_FCS             0

#endif


/******************************************

    Test & verification Configuration                                              

*******************************************/


//1 Test & verification control
#if CONFIG_VERIFICATION_MODE   
#define CONFIG_8051_IOPATH_RESET_TESTING        1   //mantis number: 9700
#define CONFIG_FULL_RANGE_MEMORY_TEST           0   //full range RAM and xdata memoey test
#define CONFIG_IO_DEBUG                         0
#define CONFIG_VERA_SIMULATION                  0   // 1:speed up vera pattern, don't initialize xdata/pdata
#define CONFIG_AFE_LOOPBACK                     0       
#define CONFIG_TRX_BUFF_RW                      0
#define CONFIG_H2C2H_LB                         0
#define CONFIG_RPWM_CPWM_LB                     0
#define CONFIG_TXBUFF_ROM_EN                    0 
#define CONFIG_ROM_VERIFICATION                 0   // 1: add test in ROM code (main_test())
#define CONFIG_TXPKTBUFTEST                     0	// Alan
#define CONFIG_IPSEC_ENGINE_RAM                 0
#define CONFIG_GTK_AES_128                      0
#define CONFIG_802_11W                          0
#define CONFIG_GTK_11W_HW					    0
#define CONFIG_GTK_VERIFICATION                 0
#if CONFIG_GTK_VERIFICATION    
    #define CONFIG_IPSEC_ENGINE_NEW             1
#if CONFIG_IPSEC_ENGINE_NEW    
    #define CONFIG_GTK_AES_VERIFICATION         1
    #define CONFIG_GTK_TKIP_VERIFICATION        0
	#define CONFIG_GTK_11W_VERIFICATION         1
    #define CONFIG_GTK_AES_128_VERIFICATION	    1
#else
    #define CONFIG_GTK_AES_VERIFICATION         1
    #define CONFIG_GTK_TKIP_VERIFICATION        0
    #define CONFIG_GTK_11W_VERIFICATION         0
	#define CONFIG_GTK_AES_128_VERIFICATION     0
#endif  //#if CONFIG_IPSEC_ENGINE_NEW  
#endif  //#if CONFIG_GTK_VERIFICATION  



#else
#define CONFIG_8051_IOPATH_RESET_TESTING        0
#define CONFIG_FULL_RANGE_MEMORY_TEST           0
#define CONFIG_IO_DEBUG                         0
#if CONFIG_CP_AFE_LBK_TEST
#define CONFIG_VERA_SIMULATION                  1       //ben, 151013
#else
#define CONFIG_VERA_SIMULATION                  0       //ben, 151013
#endif
#define CONFIG_AFE_LOOPBACK                     0       
#define CONFIG_TRX_BUFF_RW                      0
#define CONFIG_H2C2H_LB                         0
#define CONFIG_RPWM_CPWM_LB                     0
#define CONFIG_TXBUFF_ROM_EN                    0 
#define CONFIG_ROM_VERIFICATION                 0
#define CONFIG_TXPKTBUFTEST                     0	// Alan
#define CONFIG_IPSEC_ENGINE_RAM                 0
#define CONFIG_GTK_AES_128                      0
#define CONFIG_802_11W                          0
#define CONFIG_GTK_11W_HW					    0
#define CONFIG_GTK_VERIFICATION                 0
#if CONFIG_GTK_VERIFICATION    
    #define CONFIG_IPSEC_ENGINE_NEW             0
#if CONFIG_IPSEC_ENGINE_NEW    
    #define CONFIG_GTK_AES_VERIFICATION         0
    #define CONFIG_GTK_TKIP_VERIFICATION        0
	#define CONFIG_GTK_11W_VERIFICATION         0
    #define CONFIG_GTK_AES_128_VERIFICATION	    0
#else
    #define CONFIG_GTK_AES_VERIFICATION         0
    #define CONFIG_GTK_TKIP_VERIFICATION        0
    #define CONFIG_GTK_11W_VERIFICATION         0
	#define CONFIG_GTK_AES_128_VERIFICATION     0
#endif  //#if CONFIG_IPSEC_ENGINE_NEW  
#endif  //#if CONFIG_GTK_VERIFICATION  

#endif  //#if CONFIG_VERIFICATION_MODE

/******************************************

    RAM Code Configuration                                              

*******************************************/

#endif  //#ifndef _AUTOCONF_H_

